MD_xml.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:impl="http://impl.soap.ws.crane.hititcs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <impl:GetAirAvailability>
         <AirAvailabilityRequest>
            <clientInformation>
               <clientIP>129.0.0.1</clientIP>
               <member>false</member>
               <password>Test123</password>
               <userName>CHISTA</userName>
               <preferredCurrency>TMT</preferredCurrency>
            </clientInformation>
            <originDestinationInformationList>
               <dateOffset>3</dateOffset>
               <departureDateTime>2019-03-30</departureDateTime>
               <destinationLocation>
                  <locationCode>ALA</locationCode>
               </destinationLocation>
               <directFlightsOnly/><flexibleFaresOnly>false</flexibleFaresOnly>
               <includeInterlineFlights>false</includeInterlineFlights>
               <openFlight>false</openFlight>
               <originLocation>
                  <locationCode>ASB</locationCode>
               </originLocation>
            </originDestinationInformationList>
            <originDestinationInformationList>
               <dateOffset>3</dateOffset>
               <departureDateTime>2019-04-02</departureDateTime>
               <destinationLocation>
                  <locationCode>IST</locationCode>
               </destinationLocation>
               <directFlightsOnly/><flexibleFaresOnly>false</flexibleFaresOnly>
               <includeInterlineFlights>false</includeInterlineFlights>
               <openFlight>false</openFlight>
               <originLocation>
                  <locationCode>ASB</locationCode>
               </originLocation>
            </originDestinationInformationList>
            <travelerInformation>
               <passengerTypeQuantityList>
                  <hasStrecher/>
                  <passengerType>
                     <code>ADLT</code>
                  </passengerType>
                  <quantity>1</quantity>
               </passengerTypeQuantityList>
            </travelerInformation>
            <tripType>MULTI_DIRECTIONAL</tripType>
         </AirAvailabilityRequest>
      </impl:GetAirAvailability>
   </soapenv:Body>
</soapenv:Envelope>